import styles from './styles.module.css'
import arrowLeft from './img/Arrowleft.svg'
import arrowDown from './img/ArrowDown.svg'
import arrowUp from './img/arrowUp.svg'
import { ListItem } from './ListItem'

export const ChatRules = () => {
  return (
    <div className={styles.chatWrap}>
      <div className={styles.top}>
        <div className={styles.leftTop}>
          <img src={arrowLeft} alt='' />
          <p>Правила чата</p>
        </div>
        <div className={styles.rightTop}>
          <img className={styles.arrowUp} src={arrowUp} alt='' />
          <img src={arrowDown} alt='' />
        </div>
      </div>
      <div className={styles.bottom}>
        <ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        /><ListItem
          title={'Игровые автоматы в казино'}
          text={'С тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы интернета, в сети регулярно появляются новые платформы для подобных развлечений. Несмотря на огромную конкуренцию, самым популярным на сегодня остается сайт казиноС тех пор, как азартный мир и понятие "игровой автомат" перекочевали на просторы '}
        />
      </div>
    </div>
  )
}